package _go


/*
面试题 16.07. 最大数值
编写一个方法，找出两个数字a和b中最大的那一个。不得使用if-else或其他比较运算符。

示例：

输入： a = 1, b = 2
输出： 2
通过次数11,980提交次数16,332
*/

func maximum(a int, b int) int {
	dif := a - b
	k := int(uint(dif) >> 63)
	return a*(k^1) + b*k
}
/*
补码的主要作用是不需要一种专门的减法逻辑运算器

正数
原码 一致
反码 一致
补码 一致

负数补码
bit位取反  -5
原码 10000101
反码 11111010
补码 11111011


11进1,10得1，00得0

2-1=2+(-1)
2:   00000010
-1:  10000001 原码
	 11111110 反码
	 11111111 补码

	 00000010 补码
	 11111111 补码
	 11111121 溢出
	 00000001


5-10=5+(-10)
5    00000101
-10  10001010  原码
	 11110101  反码
     11110110  补码

	 00000101 5   补码
	 11110110 -10 补码
	 11111011     补码
	 11111010     反码
     10000101     原码





*/


